; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph0 - mode
	infrared1 - mode
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	Star3 - direction
	Star1 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 7
3. (turn_to satellite1 planet11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet11)
   goals met: 0 of 7
4. (take_image satellite1 planet11 instrument2 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (take_image satellite1 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 2 of 7
10. (turn_to satellite0 planet12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet12)
   goals met: 2 of 7
11. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 3 of 7
12. (turn_to satellite0 star4 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star4)
   goals met: 4 of 7
13. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 4 of 7
14. (take_image satellite1 planet8 instrument2 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 5 of 7
15. (turn_to satellite1 star7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star7)
   goals met: 5 of 7
16. (take_image satellite1 star7 instrument2 infrared1)
   added: (have_image star7 infrared1)
   goals met: 6 of 7
17. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 6 of 7
18. (take_image satellite1 star9 instrument2 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 7
